podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/ADC0_S32K142.svd.xml
<!--
Devices using this peripheral:
      S32K142
      S32K144
      S32K146
      S32K148
-->
      <peripheral>
         <?sourceFile "ADC0_S32K142" ?>
         <name>ADC0</name>
         <description>Analog-to-Digital Converter</description>
         <groupName>ADC</groupName>
         <headerStructName>ADC</headerStructName>
         <baseAddress>0x4003B000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <parameters>
            <parameter> <value>16</value> <name>SC1_COUNT</name> <description>Number of ADC channels</description></parameter>
         </parameters>
         <addressBlock>
            <offset>0x0</offset>
            <size>0xEC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>$(SC1_COUNT)</dim>
               <dimIncrement>4</dimIncrement>
               <name>SC1%s</name>
               <description>Status and Control Register 1</description>
               <addressOffset>0x0</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>ADCH</name>
                     <description>Input Channel Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000000</name>
                           <description>AD0</description>
                           <value>0b000000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b000001</name>
                           <description>AD1</description>
                           <value>0b000001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b000010</name>
                           <description>AD2</description>
                           <value>0b000010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b000011</name>
                           <description>AD3</description>
                           <value>0b000011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b000100</name>
                           <description>AD4</description>
                           <value>0b000100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b000101</name>
                           <description>AD5</description>
                           <value>0b000101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b000110</name>
                           <description>AD6</description>
                           <value>0b00110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b000111</name>
                           <description>AD7</description>
                           <value>0b00111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001000</name>
                           <description>AD8</description>
                           <value>0b001000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001001</name>
                           <description>AD9</description>
                           <value>0b001001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001010</name>
                           <description>AD10</description>
                           <value>0b001010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001011</name>
                           <description>AD11</description>
                           <value>0b001011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001100</name>
                           <description>AD12</description>
                           <value>0b001100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001101</name>
                           <description>AD13</description>
                           <value>0b001101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001110</name>
                           <description>AD14</description>
                           <value>0b001110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001111</name>
                           <description>AD15</description>
                           <value>0b001111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010101</name>
                           <description>Internal channel 0</description>
                           <value>0b010101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010110</name>
                           <description>Internal channel 1</description>
                           <value>0b010110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010111</name>
                           <description>Internal channel 2</description>
                           <value>0b010111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011010</name>
                           <description>Temp Sensor(if present)</description>
                           <value>0b011010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011011</name>
                           <description>Band Gap</description>
                           <value>0b011011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011100</name>
                           <description>Internal channel 3</description>
                           <value>0b011100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011101</name>
                           <description>VREFSH from SC2[REFSEL]</description>
                           <value>0b011101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011110</name>
                           <description>VREFSL from SC2[REFSEL]</description>
                           <value>0b011110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011111</name>
                           <description>Module is disabled</description>
                           <value>0b011111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100000</name>
                           <description>Internal channel 16</description>
                           <value>0b100000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100001</name>
                           <description>AD17</description>
                           <value>0b100001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100010</name>
                           <description>AD18</description>
                           <value>0b100010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100011</name>
                           <description>AD19</description>
                           <value>0b100011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100100</name>
                           <description>AD20</description>
                           <value>0b100100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100101</name>
                           <description>AD21</description>
                           <value>0b100101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100110</name>
                           <description>AD22</description>
                           <value>0b100110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100111</name>
                           <description>AD23</description>
                           <value>0b100111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101000</name>
                           <description>AD24</description>
                           <value>0b101000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101001</name>
                           <description>AD25</description>
                           <value>0b101001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101010</name>
                           <description>AD26</description>
                           <value>0b101010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101011</name>
                           <description>AD27</description>
                           <value>0b101011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101100</name>
                           <description>AD28</description>
                           <value>0b101100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101101</name>
                           <description>AD29</description>
                           <value>0b101101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101110</name>
                           <description>AD30</description>
                           <value>0b101110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101111</name>
                           <description>AD31</description>
                           <value>0b101111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111111</name>
                           <description>Module is disabled</description>
                           <value>0b111111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AIEN</name>
                     <description>Conversion Complete Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COCO</name>
                     <description>Conversion Complete Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not complete</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Complete</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG1</name>
               <description>Configuration Register 1</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>ADICLK</name>
                     <description>Input Clock Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Alternate clock 1 (ADC_ALTCLK1)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Alternate clock 2 (ADC_ALTCLK2)</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Alternate clock 3 (ADC_ALTCLK3)</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Alternate clock 4 (ADC_ALTCLK4)</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>ADC resolution\n
Single-ended/Differential(if available)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>8-bit/9-bit-2&apos;s complement</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>12-bit/13-bit-2&apos;s complement</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>10-bit/11-bit-2&apos;s complement</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADIV</name>
                     <description>Clock Divide Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Divide by 1</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Divide by 2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Divide by 4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Divide by 8</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLRLTRG</name>
                     <description>Clear Latch Trigger in Trigger Handler Block</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG2</name>
               <description>Configuration Register 2</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>SMPLTS</name>
                     <description>Sample Time Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>$(SC1_COUNT)</dim>
               <dimIncrement>4</dimIncrement>
               <name>R%s</name>
               <description>Data Result Register</description>
               <addressOffset>0x48</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>D</name>
                     <description>Data result</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>1,2</dimIndex>
               <name>CV%s</name>
               <description>Compare Value</description>
               <addressOffset>0x88</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CV</name>
                     <description>Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
